In [4]:
import pandas as pd

print(pd.__version__)

2.2.2

In [6]:
data = {'nama': ['bayu', 'indra', 'devi', 'agni'],
        'jenis _kelamin ': ['L', 'L', 'P', 'L'],
        'usia': [23, 21, 22, 25]}
df = pd.DataFrame (data)
df

    nama jenis _kelamin   usia
0   bayu               L    23
1  indra               L    21
2   devi               P    22
3   agni               L    25

In [8]:
usia = df.pop('usia').to_frame()

In [10]:
df

    nama jenis _kelamin
0   bayu               L
1  indra               L
2   devi               P
3   agni               L

In [12]:
usia

   usia
0    23
1    21
2    22
3    25